IdeaRS.OpenModel.Material.MatConcreteSIA
Material concrete SIA

IdeaRS.OpenModel.Material.MatConcreteSIA.CalculateDependentValues
setting calculation dependent values on fck

IdeaRS.OpenModel.Material.MatConcreteSIA.Fck
characteristic compressive cylinder strength of concrete at 28 days

IdeaRS.OpenModel.Material.MatConcreteSIA.Fcm
mean value of concrete cylinder compressive strength

IdeaRS.OpenModel.Material.MatConcreteSIA.Ecm
secant modulus of elasticity of concrete

IdeaRS.OpenModel.Material.MatConcreteSIA.Fctm
mean value of axial tensile strength of concrete

IdeaRS.OpenModel.Material.MatConcreteSIA.Fctk_0_05
characteristic axial tensile strength of concrete 5% quantile

IdeaRS.OpenModel.Material.MatConcreteSIA.Fctk_0_95
characteristic axial tensile strength of concrete 95% quantile

IdeaRS.OpenModel.Material.MatConcreteSIA.Nfc
conversion factor nfc

IdeaRS.OpenModel.Material.MatConcreteSIA.Tck
characteristic  value of the shear stress limit

IdeaRS.OpenModel.Material.MatConcreteSIA.Epsc1d
compressive strain in the concrete

IdeaRS.OpenModel.Material.MatConcreteSIA.Epsc2d
compressive strain in the concrete

IdeaRS.OpenModel.Material.MatConcreteSIA.StoneDiameter
diameter of stone

IdeaRS.OpenModel.Material.MatConcreteSIA.AggregateType
type of aggregate

IdeaRS.OpenModel.Material.MatConcreteSIA.CementClass
type of cement class

IdeaRS.OpenModel.Material.MatConcreteSIA.DiagramType
type of stress-strain diagram bilinear/parabolic/general for ULS calculation

IdeaRS.OpenModel.Material.MatConcreteSIA.PlainConcreteDiagram
Stress strain diagram with tension part